import re
o="нннннннннннаркруфклоа(мркеопмкнннкепл)коеин(укерпмицнукепмуремнннннннн)нннннннннннннннннннннннкрмикшмкмнкмкриннннннукормнн"
p=re.findall("[н]+",o)
j=max(p)
oo = o.replace(j,len(j)*"!")
print(oo)
print(len(j))
o="нннннннннннаркруфклоа(мркеопмкнннкепл)коеин(укерпмицнукепмуремнннннннн)нннннннннннннннннннннннкрмикшмкмнкмкриннннннукормнн"
p=re.findall("\((.*?)\)",o)
print(p)
o="нннннннннннаркруфкло Абстракция а(мркеопмкнннкепл)коеин(укерпмицнукепмуремнннннннн)нннннннннннннннннннннннкрмикшмкмнкмкриннннннукормнн"
oo=split
p=re.findall("\b[аА].*[яЯ]\b",o)
print(p)
