import re
o="нннннннннннаркруфклоа(мркеопмкнннкепл)коеинукерпмицнукепмуремнннннннннннннннннннннннннннннннкрмикшмкмнкмкриннннннукормнн"
p=re.findall("[н]+",o)
j=max(p)
oo = o.replace(j,len(j)*"!")
print(oo)
print(len(j))
o="нннннннннннаркруфклоа(мркеопмкнннкепл)коеинукерпмицнукепмуремнннннннннннннннннннннннннннннннкрмикшмкмнкмкриннннннукормнн"
p=re.findall("\((.*?)\)",o)
print(p)
o="нннннннннннаркруфкло Абстракция а(мркеопмкнннкепл)коеинукерпмицнукепмуремнннннннннннннннннннннннннннннннкрмикшмкмнкмкриннннннукормнн"
p=re.findall(r"\b[аА].*[яЯ]\b",o)
print(p)
